Autodesk.Revit.UI.ElemAttribDialogUtil.ShowEnergyDataSettingsDialog(Autodesk.Revit.DB.Document,System.Boolean)
Shows the Energy Data Settings dialog.
doc:
The document of energy data settings to be displayed.
isAdvanced:
Indicates if the dialog is for the advanced option.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.UI.ElemAttribDialogUtil
Provides internal utility methods that display the element attribute dialog.
Since:
2022